// Задание 1
// Создайте переменную a. Запишите в нее значение 10, выведите его на экран с помощью метода 
// alert(). Затем запишите в нее же значение 20, выведите его на экран.

let a = 10;
alert(a);
a = 20;
alert(a);


// Задание 2
// Создайте переменную и присвойте ей значение года выпуска первого iPhone. Выведите значение переменной на экран.
let year = 2007;
alert(`Первый iPhone был выпущен в ${year} году.`);


// Задание 3
// Создайте переменную и присвойте ей значение имени создателя языка JavaScript. Выведите значение переменной на экран.
let creatorName = "Брендан Эйх";
alert(`Создатель языка JavaScript - ${creatorName}`);


// Задание 4
// Создайте две переменные: 10 и 2. С помощью метода alert()
//  выведите на экран их сумму, разность, произведение и частное (результат деления).
let first = 10;
let second = 2;

let sum = first + second;
let diff = first - second;
let product = first * second;
let div = first / second;

alert(`${first} + ${second} = ${sum}
\n${first} - ${second} = ${diff}
\n${first} * ${second} = ${product}
\n${first} / ${second} = ${div}`);


//  Задание 5
// Возведите 2 в 5-ю степень. Результат запишите в переменную result
//  и выведите на экран с помощью метода alert().
let result = 2 ** 5;
alert(`2 в пятой степени равно ${result}`)


// Задание 6
// Даны переменные: a = 9 и b = 2. Найдите остаток от деления a на b
//  и выведите результат на экран с помощью метода alert().
a = 9;
let b = 2;
alert(`Остаток от деления ${a} на ${b} равен ${result = a % b}`);


// Задание 7
/* Перепишите код с использованием операторов присваивания и инкремента/декремента (количество строк должно остаться прежним):
let num = 1;
num = num + 5;
num = num - 3;
num = num * 7;
num = num / 3;
num = num + 1;
num = num - 1;
alert(num);*/
let num = 1;
num +=  5;
num -= 3;
num *= 7;
num /= 3;
num++;
num--;
alert(num);



// Задание 8
// Создайте переменную age, присвойте ей значение с помощью метода prompt()
//  «Сколько вам лет?». Результат выведите с помощью alert().
let age = prompt("Сколько вам лет?");
alert(`Вам ${age} лет`);


// Задание 9
// Создайте объект user, у которого есть следующие свойства: name, age, isAdmin. Значения для свойств придумайте произвольные. Обратите внимание, что для свойства name значение должно быть строковым, для age — числовым, а для isAdmin — булевым.
// let user = {
//   // name: "Имя",
//   // age: 123,
//   // isAdmin: false
// };

let user = new Object();

user.name = "Имя";
user.age = 123;
user["isAdmin"] = false;

user = JSON.stringify(user)
alert(`Это объект user:\n${user}`)


// Задание 10
// С помощью метода prompt() спросите у пользователя его имя и сохраните в переменную. С помощью метода 
// alert() выведите на экран шаблонную строку: Привет, ИМЯ!
let answer = prompt("Напишите ваше имя");
alert(`Привет ${answer}!`)


/* Дополнительное задание
Попросите пользователя загадать любое число и сохранить его в переменной 
number с помощью метода prompt().
Удвоить загаданное число, сохранить результат в новой переменной и показать его пользователю с помощью метода alert().
К удвоенному числу прибавить 10, сохранить результат в новой переменной и показать его пользователю с помощью метода alert().
Полученное число разделить на 2, сохранить результат в новой переменной и показать его пользователю с помощью метода alert().
Из результата вычесть первоначальное загаданное число, сохранить результат в новой переменной и показать его пользователю с помощью метода alert().
Сообщите пользователю, что ответ равен 5.*/

let number = prompt("Загадайте любое число и напишите его сюда");
let doubleNumber = number * 2;
alert(`Удвоенное число: ${doubleNumber}`);
let sumNumber = doubleNumber + 10;
alert(`К числу добавили 10: ${sumNumber}`);
let divNumber = sumNumber / 2;
alert(`Результат разделили на 2: ${divNumber}`);
let finalResult = divNumber - number;
alert(`И вычли загаданное число. Рузультат: ${finalResult}`);
